/*
 Navicat Premium Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 80021
 Source Host           : localhost:3306
 Source Schema         : reggie

 Target Server Type    : MySQL
 Target Server Version : 80021
 File Encoding         : 65001

 Date: 01/06/2022 00:07:52
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for address_book
-- ----------------------------
DROP TABLE IF EXISTS `address_book`;
CREATE TABLE `address_book`  (
  `id` bigint(0) NOT NULL COMMENT '主键',
  `user_id` bigint(0) NOT NULL COMMENT '用户id',
  `consignee` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '收货人',
  `sex` tinyint(0) NOT NULL COMMENT '性别 0 女 1 男',
  `phone` varchar(11) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '手机号',
  `province_code` varchar(12) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '省级区划编号',
  `province_name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '省级名称',
  `city_code` varchar(12) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '市级区划编号',
  `city_name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '市级名称',
  `district_code` varchar(12) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '区级区划编号',
  `district_name` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '区级名称',
  `detail` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '详细地址',
  `label` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '标签',
  `is_default` tinyint(1) NOT NULL DEFAULT 0 COMMENT '默认 0 否 1是',
  `create_time` datetime(0) NOT NULL COMMENT '创建时间',
  `update_time` datetime(0) NOT NULL COMMENT '更新时间',
  `create_user` bigint(0) NOT NULL COMMENT '创建人',
  `update_user` bigint(0) NOT NULL COMMENT '修改人',
  `is_deleted` int(0) NOT NULL DEFAULT 0 COMMENT '是否删除',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_bin COMMENT = '地址管理' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of address_book
-- ----------------------------
INSERT INTO `address_book` VALUES (1417414526093082626, 1417012167126876162, '小明', 1, '13812345678', NULL, NULL, NULL, NULL, NULL, NULL, '昌平区金燕龙办公楼', '公司', 1, '2021-07-20 17:22:12', '2021-07-20 17:26:33', 1417012167126876162, 1417012167126876162, 0);
INSERT INTO `address_book` VALUES (1417414926166769666, 1417012167126876162, '小李', 1, '13512345678', NULL, NULL, NULL, NULL, NULL, NULL, '测试', '家', 0, '2021-07-20 17:23:47', '2021-07-20 17:23:47', 1417012167126876162, 1417012167126876162, 0);
INSERT INTO `address_book` VALUES (1526795358695444481, 1526570471523463170, '季沧海', 1, '17350066931', NULL, NULL, NULL, NULL, NULL, NULL, '聚窟洲三族大议所', '公司', 1, '2022-05-18 13:22:35', '2022-05-29 00:17:49', 1526570471523463170, 1526570471523463170, 0);
INSERT INTO `address_book` VALUES (1526841709529518082, 1526570471523463170, '季沧海', 1, '17350066931', NULL, NULL, NULL, NULL, NULL, NULL, '莆田学院凤C813', '学校', 0, '2022-05-18 16:26:46', '2022-05-18 17:58:27', 1526570471523463170, 1526570471523463170, 0);
INSERT INTO `address_book` VALUES (1526870860684627969, 1526570471523463170, '胡桃', 0, '17350066932', NULL, NULL, NULL, NULL, NULL, NULL, '聚窟洲森罗谷', '家', 0, '2022-05-18 18:22:36', '2022-05-18 18:22:36', 1526570471523463170, 1526570471523463170, 0);
INSERT INTO `address_book` VALUES (1527927619142676481, 1527583379548139521, '胡桃', 0, '17350066933', NULL, NULL, NULL, NULL, NULL, NULL, '聚窟洲森罗谷', '公司', 0, '2022-05-21 16:21:47', '2022-05-21 16:21:47', 1527583379548139521, 1527583379548139521, 0);
INSERT INTO `address_book` VALUES (1527927742178390017, 1527583379548139521, '胡桃', 0, '17350066933', NULL, NULL, NULL, NULL, NULL, NULL, '聚窟洲天人城', '家', 1, '2022-05-21 16:22:16', '2022-05-21 16:30:37', 1527583379548139521, 1527583379548139521, 0);
INSERT INTO `address_book` VALUES (1530537662225436673, 1530511956485451777, '王雄戊', 1, '17350066934', NULL, NULL, NULL, NULL, NULL, NULL, '人防侧耳TV费', '学校', 0, '2022-05-28 21:13:09', '2022-05-28 21:13:09', 1530511956485451777, 1530511956485451777, 0);
INSERT INTO `address_book` VALUES (1530537771646439425, 1530511956485451777, '王雄戊', 1, '17350066935', NULL, NULL, NULL, NULL, NULL, NULL, '天人城', '学校', 1, '2022-05-28 21:13:35', '2022-05-29 00:54:58', 1530511956485451777, 1530511956485451777, 0);
INSERT INTO `address_book` VALUES (1530579374247350273, 1530579216340193281, '王雄戊', 1, '15659698017', NULL, NULL, NULL, NULL, NULL, NULL, '莆田学院', '公司', 1, '2022-05-28 23:58:54', '2022-05-28 23:58:56', 1530579216340193281, 1530579216340193281, 0);
INSERT INTO `address_book` VALUES (1530907656368283650, 1530893480702885890, '王雄戊', 1, '15659698017', NULL, NULL, NULL, NULL, NULL, NULL, '人防侧耳TV费', '公司', 1, '2022-05-29 21:43:23', '2022-05-29 21:43:24', 1530893480702885890, 1530893480702885890, 0);
INSERT INTO `address_book` VALUES (1531108389982142466, 1531106576365092865, '王雄戊', 1, '17350066930', NULL, NULL, NULL, NULL, NULL, NULL, 'ptu', '学校', 1, '2022-05-30 11:01:01', '2022-05-30 11:01:03', 1531106576365092865, 1531106576365092865, 0);

-- ----------------------------
-- Table structure for category
-- ----------------------------
DROP TABLE IF EXISTS `category`;
CREATE TABLE `category`  (
  `id` bigint(0) NOT NULL COMMENT '主键',
  `type` int(0) NULL DEFAULT NULL COMMENT '类型   1 菜品分类 2 套餐分类',
  `name` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '分类名称',
  `sort` int(0) NOT NULL DEFAULT 0 COMMENT '顺序',
  `create_time` datetime(0) NOT NULL COMMENT '创建时间',
  `update_time` datetime(0) NOT NULL COMMENT '更新时间',
  `create_user` bigint(0) NOT NULL COMMENT '创建人',
  `update_user` bigint(0) NOT NULL COMMENT '修改人',
  `is_deleted` int(0) NOT NULL DEFAULT 0 COMMENT '是否删除',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `idx_category_name`(`name`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_bin COMMENT = '菜品及套餐分类' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of category
-- ----------------------------
INSERT INTO `category` VALUES (1397844263642378242, 1, '湘菜', 1, '2021-05-27 09:16:58', '2022-05-13 23:48:04', 1, 1, 0);
INSERT INTO `category` VALUES (1397844303408574465, 1, '川菜', 2, '2021-05-27 09:17:07', '2021-06-02 14:27:22', 1, 1, 0);
INSERT INTO `category` VALUES (1397844391040167938, 1, '粤菜', 3, '2021-05-27 09:17:28', '2021-07-09 14:37:13', 1, 1, 0);
INSERT INTO `category` VALUES (1413341197421846529, 1, '饮品', 11, '2021-07-09 11:36:15', '2021-07-09 14:39:15', 1, 1, 0);
INSERT INTO `category` VALUES (1413342269393674242, 2, '商务套餐', 5, '2021-07-09 11:40:30', '2021-07-09 14:43:45', 1, 1, 0);
INSERT INTO `category` VALUES (1413384954989060097, 1, '主食', 12, '2021-07-09 14:30:07', '2021-07-09 14:39:19', 1, 1, 0);
INSERT INTO `category` VALUES (1413386191767674881, 2, '儿童套餐', 6, '2021-07-09 14:35:02', '2021-07-09 14:39:05', 1, 1, 0);
INSERT INTO `category` VALUES (1525123964160991234, 1, '闽菜', 1, '2022-05-13 22:41:03', '2022-05-13 22:41:03', 1, 1, 0);

-- ----------------------------
-- Table structure for dish
-- ----------------------------
DROP TABLE IF EXISTS `dish`;
CREATE TABLE `dish`  (
  `id` bigint(0) NOT NULL COMMENT '主键',
  `name` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '菜品名称',
  `category_id` bigint(0) NOT NULL COMMENT '菜品分类id',
  `price` decimal(10, 2) NULL DEFAULT NULL COMMENT '菜品价格',
  `code` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '商品码',
  `image` varchar(200) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '图片',
  `description` varchar(400) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '描述信息',
  `status` int(0) NOT NULL DEFAULT 1 COMMENT '0 停售 1 起售',
  `sort` int(0) NOT NULL DEFAULT 0 COMMENT '顺序',
  `create_time` datetime(0) NOT NULL COMMENT '创建时间',
  `update_time` datetime(0) NOT NULL COMMENT '更新时间',
  `create_user` bigint(0) NOT NULL COMMENT '创建人',
  `update_user` bigint(0) NOT NULL COMMENT '修改人',
  `is_deleted` int(0) NOT NULL DEFAULT 0 COMMENT '是否删除',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `idx_dish_name`(`name`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_bin COMMENT = '菜品管理' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of dish
-- ----------------------------
INSERT INTO `dish` VALUES (1397849739276890114, '辣子鸡', 1397844263642378242, 7800.00, '222222222', 'f966a38e-0780-40be-bb52-5699d13cb3d9.jpg', '来自鲜嫩美味的小鸡，值得一尝', 1, 0, '2021-05-27 09:38:43', '2021-05-27 09:38:43', 1, 1, 0);
INSERT INTO `dish` VALUES (1397850140982161409, '毛氏红烧肉', 1397844263642378242, 6800.00, '123412341234', '0a3b3288-3446-4420-bbff-f263d0c02d8e.jpg', '毛氏红烧肉毛氏红烧肉，确定不来一份？', 1, 0, '2021-05-27 09:40:19', '2021-05-27 09:40:19', 1, 1, 0);
INSERT INTO `dish` VALUES (1397850392090947585, '组庵鱼翅', 1397844263642378242, 4800.00, '123412341234', '740c79ce-af29-41b8-b78d-5f49c96e38c4.jpg', '组庵鱼翅，看图足以表明好吃程度', 1, 0, '2021-05-27 09:41:19', '2021-05-27 09:41:19', 1, 1, 0);
INSERT INTO `dish` VALUES (1397850851245600769, '霸王别姬', 1397844263642378242, 12800.00, '123412341234', '057dd338-e487-4bbc-a74c-0384c44a9ca3.jpg', '还有什么比霸王别姬更美味的呢？', 1, 0, '2021-05-27 09:43:08', '2021-05-27 09:43:08', 1, 1, 0);
INSERT INTO `dish` VALUES (1397851099502260226, '全家福', 1397844263642378242, 11800.00, '23412341234', 'a53a4e6a-3b83-4044-87f9-9d49b30a8fdc.jpg', '别光吃肉啦，来份全家福吧，让你长寿又美味', 1, 0, '2021-05-27 09:44:08', '2021-05-27 09:44:08', 1, 1, 0);
INSERT INTO `dish` VALUES (1397851370462687234, '邵阳猪血丸子', 1397844263642378242, 13800.00, '1246812345678', '2a50628e-7758-4c51-9fbb-d37c61cdacad.jpg', '看，美味不？来嘛来嘛，这才是最爱吖', 1, 0, '2021-05-27 09:45:12', '2021-05-27 09:45:12', 1, 1, 0);
INSERT INTO `dish` VALUES (1397851668262465537, '口味蛇', 1397844263642378242, 16800.00, '1234567812345678', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', '爬行界的扛把子，东兴-口味蛇，让你欲罢不能', 1, 0, '2021-05-27 09:46:23', '2021-05-27 09:46:23', 1, 1, 0);
INSERT INTO `dish` VALUES (1397852391150759938, '辣子鸡丁', 1397844303408574465, 8800.00, '2346812468', 'ef2b73f2-75d1-4d3a-beea-22da0e1421bd.jpg', '辣子鸡丁，辣子鸡丁，永远的魂', 1, 0, '2021-05-27 09:49:16', '2021-05-27 09:49:16', 1, 1, 0);
INSERT INTO `dish` VALUES (1397853183287013378, '麻辣兔头', 1397844303408574465, 19800.00, '123456787654321', '2a2e9d66-b41d-4645-87bd-95f2cfeed218.jpg', '麻辣兔头的详细制作，麻辣鲜香，色泽红润，回味悠长', 1, 0, '2021-05-27 09:52:24', '2021-05-27 09:52:24', 1, 1, 0);
INSERT INTO `dish` VALUES (1397853709101740034, '蒜泥白肉', 1397844303408574465, 9800.00, '1234321234321', 'd2f61d70-ac85-4529-9b74-6d9a2255c6d7.jpg', '多么的有食欲啊', 1, 0, '2021-05-27 09:54:30', '2021-05-27 09:54:30', 1, 1, 0);
INSERT INTO `dish` VALUES (1397853890262118402, '鱼香肉丝', 1397844303408574465, 3800.00, '1234212321234', '8dcfda14-5712-4d28-82f7-ae905b3c2308.jpg', '鱼香肉丝简直就是我们童年回忆的一道经典菜，上学的时候点个鱼香肉丝盖饭坐在宿舍床上看着肥皂剧，绝了！现在完美复刻一下上学的时候感觉', 1, 0, '2021-05-27 09:55:13', '2021-05-27 09:55:13', 1, 1, 0);
INSERT INTO `dish` VALUES (1397854652581064706, '麻辣水煮鱼', 1397844303408574465, 14800.00, '2345312·345321', '1fdbfbf3-1d86-4b29-a3fc-46345852f2f8.jpg', '鱼片是买的切好的鱼片，放几个虾，增加味道', 1, 0, '2021-05-27 09:58:15', '2021-05-27 09:58:15', 1, 1, 0);
INSERT INTO `dish` VALUES (1397854865672679425, '鱼香炒鸡蛋', 1397844303408574465, 2000.00, '23456431·23456', '0f252364-a561-4e8d-8065-9a6797a6b1d3.jpg', '鱼香菜也是川味的特色。里面没有鱼却鱼香味', 1, 0, '2021-05-27 09:59:06', '2021-05-27 09:59:06', 1, 1, 0);
INSERT INTO `dish` VALUES (1397860242057375745, '脆皮烧鹅', 1397844391040167938, 12800.00, '123456786543213456', 'e476f679-5c15-436b-87fa-8c4e9644bf33.jpeg', '“广东烤鸭美而香，却胜烧鹅说古冈（今新会），燕瘦环肥各佳妙，君休偏重便宜坊”，可见烧鹅与烧鸭在粤菜之中已早负盛名。作为广州最普遍和最受欢迎的烧烤肉食，以它的“色泽金红，皮脆肉嫩，味香可口”的特色，在省城各大街小巷的烧卤店随处可见。', 1, 0, '2021-05-27 10:20:27', '2021-05-27 10:20:27', 1, 1, 0);
INSERT INTO `dish` VALUES (1397860792492666881, '烤乳猪', 1397844391040167938, 38800.00, '213456432123456', '2e96a7e3-affb-438e-b7c3-e1430df425c9.jpeg', '广式烧乳猪主料是小乳猪，辅料是蒜，调料是五香粉、芝麻酱、八角粉等，本菜品主要通过将食材放入炭火中烧烤而成。烤乳猪是广州最著名的特色菜，并且是“满汉全席”中的主打菜肴之一。烤乳猪也是许多年来广东人祭祖的祭品之一，是家家都少不了的应节之物，用乳猪祭完先人后，亲戚们再聚餐食用。', 1, 0, '2021-05-27 10:22:39', '2021-05-27 10:22:39', 1, 1, 0);
INSERT INTO `dish` VALUES (1397860963880316929, '脆皮乳鸽', 1397844391040167938, 10800.00, '1234563212345', '3fabb83a-1c09-4fd9-892b-4ef7457daafa.jpeg', '“脆皮乳鸽”是广东菜中的一道传统名菜，属于粤菜系，具有皮脆肉嫩、色泽红亮、鲜香味美的特点，常吃可使身体强健，清肺顺气。随着菜品制作工艺的不断发展，逐渐形成了熟炸法、生炸法和烤制法三种制作方法。无论那种制作方法，都是在鸽子经过一系列的加工，挂脆皮水后再加工而成，正宗的“脆皮乳鸽皮脆肉嫩、色泽红亮、鲜香味美、香气馥郁。这三种方法的制作过程都不算复杂，但想达到理想的效果并不容易。', 1, 0, '2021-05-27 10:23:19', '2021-05-27 10:23:19', 1, 1, 0);
INSERT INTO `dish` VALUES (1397861683434139649, '清蒸河鲜海鲜', 1397844391040167938, 38800.00, '1234567876543213456', '1405081e-f545-42e1-86a2-f7559ae2e276.jpeg', '新鲜的海鲜，清蒸是最好的处理方式。鲜，体会为什么叫海鲜。清蒸是广州最经典的烹饪手法，过去岭南地区由于峻山大岭阻隔，交通不便，经济发展起步慢，自家打的鱼放在锅里煮了就吃，没有太多的讲究，但却发现这清淡的煮法能使鱼的鲜甜跃然舌尖。', 1, 0, '2021-05-27 10:26:11', '2022-05-16 17:59:34', 1, 1, 0);
INSERT INTO `dish` VALUES (1397862198033297410, '老火靓汤', 1397844391040167938, 49800.00, '123456786532455', '583df4b7-a159-4cfc-9543-4f666120b25f.jpeg', '老火靓汤又称广府汤，是广府人传承数千年的食补养生秘方，慢火煲煮的中华老火靓汤，火候足，时间长，既取药补之效，又取入口之甘甜。 广府老火汤种类繁多，可以用各种汤料和烹调方法，烹制出各种不同口味、不同功效的汤来。', 1, 0, '2021-05-27 10:28:14', '2021-05-27 10:28:14', 1, 1, 0);
INSERT INTO `dish` VALUES (1397862477831122945, '上汤焗龙虾', 1397844391040167938, 108800.00, '1234567865432', '5b8d2da3-3744-4bb3-acdc-329056b8259d.jpeg', '上汤焗龙虾是一道色香味俱全的传统名菜，属于粤菜系。此菜以龙虾为主料，配以高汤制成的一道海鲜美食。本品肉质洁白细嫩，味道鲜美，蛋白质含量高，脂肪含量低，营养丰富。是色香味俱全的传统名菜。', 1, 0, '2021-05-27 10:29:20', '2021-05-27 10:29:20', 1, 1, 0);
INSERT INTO `dish` VALUES (1413342036832100354, '北冰洋', 1413341197421846529, 500.00, '', 'c99e0aab-3cb7-4eaa-80fd-f47d4ffea694.png', '', 1, 0, '2021-07-09 11:39:35', '2022-05-16 16:42:19', 1, 1, 0);
INSERT INTO `dish` VALUES (1413385247889891330, '米饭', 1413384954989060097, 200.00, '', 'ee04a05a-1230-46b6-8ad5-1a95b140fff3.png', '', 1, 0, '2021-07-09 14:31:17', '2022-05-16 16:42:19', 1, 1, 0);
INSERT INTO `dish` VALUES (1526147348915380226, '麻婆豆腐', 1397844303408574465, 600.00, '', '1d820b791b8b4f3f96332cc35a7f8b11.png', '麻、辣、烫、鲜、香、酥、活', 1, 0, '2022-05-16 18:27:37', '2022-05-16 18:27:37', 1, 1, 0);
INSERT INTO `dish` VALUES (1526150033962000386, '王老吉', 1413341197421846529, 500.00, '', 'd30af3240ba744f38aeb9e9fca9c8bf2.png', '去火', 1, 0, '2022-05-16 18:38:17', '2022-05-16 18:38:17', 1, 1, 0);

-- ----------------------------
-- Table structure for dish_flavor
-- ----------------------------
DROP TABLE IF EXISTS `dish_flavor`;
CREATE TABLE `dish_flavor`  (
  `id` bigint(0) NOT NULL COMMENT '主键',
  `dish_id` bigint(0) NOT NULL COMMENT '菜品',
  `name` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '口味名称',
  `value` varchar(500) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '口味数据list',
  `create_time` datetime(0) NOT NULL COMMENT '创建时间',
  `update_time` datetime(0) NOT NULL COMMENT '更新时间',
  `create_user` bigint(0) NOT NULL COMMENT '创建人',
  `update_user` bigint(0) NOT NULL COMMENT '修改人',
  `is_deleted` int(0) NOT NULL DEFAULT 0 COMMENT '是否删除',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_bin COMMENT = '菜品口味关系表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of dish_flavor
-- ----------------------------
INSERT INTO `dish_flavor` VALUES (1397849417888346113, 1397849417854791681, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:37:27', '2021-05-27 09:37:27', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397849739297861633, 1397849739276890114, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 09:38:43', '2021-05-27 09:38:43', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397849739323027458, 1397849739276890114, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:38:43', '2021-05-27 09:38:43', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397849936421761025, 1397849936404983809, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 09:39:30', '2021-05-27 09:39:30', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397849936438538241, 1397849936404983809, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:39:30', '2021-05-27 09:39:30', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397850141015715841, 1397850140982161409, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 09:40:19', '2021-05-27 09:40:19', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397850141040881665, 1397850140982161409, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:40:19', '2021-05-27 09:40:19', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397850392120307713, 1397850392090947585, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:41:19', '2021-05-27 09:41:19', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397850392137084929, 1397850392090947585, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:41:19', '2021-05-27 09:41:19', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397850630734262274, 1397850630700707841, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 09:42:16', '2021-05-27 09:42:16', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397850630755233794, 1397850630700707841, '辣度', '[\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:42:16', '2021-05-27 09:42:16', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397850851274960898, 1397850851245600769, '忌口', '[\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 09:43:08', '2021-05-27 09:43:08', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397850851283349505, 1397850851245600769, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:43:08', '2021-05-27 09:43:08', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397851099523231745, 1397851099502260226, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 09:44:08', '2021-05-27 09:44:08', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397851099527426050, 1397851099502260226, '辣度', '[\"不辣\",\"微辣\",\"中辣\"]', '2021-05-27 09:44:08', '2021-05-27 09:44:08', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397851370483658754, 1397851370462687234, '温度', '[\"热饮\",\"常温\",\"去冰\",\"少冰\",\"多冰\"]', '2021-05-27 09:45:12', '2021-05-27 09:45:12', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397851370483658755, 1397851370462687234, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 09:45:12', '2021-05-27 09:45:12', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397851370483658756, 1397851370462687234, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:45:12', '2021-05-27 09:45:12', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397851668283437058, 1397851668262465537, '温度', '[\"热饮\",\"常温\",\"去冰\",\"少冰\",\"多冰\"]', '2021-05-27 09:46:23', '2021-05-27 09:46:23', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397852391180120065, 1397852391150759938, '忌口', '[\"不要葱\",\"不要香菜\",\"不要辣\"]', '2021-05-27 09:49:16', '2021-05-27 09:49:16', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397852391196897281, 1397852391150759938, '辣度', '[\"不辣\",\"微辣\",\"重辣\"]', '2021-05-27 09:49:16', '2021-05-27 09:49:16', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397853183307984898, 1397853183287013378, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:52:24', '2021-05-27 09:52:24', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397853423486414850, 1397853423461249026, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:53:22', '2021-05-27 09:53:22', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397853709126905857, 1397853709101740034, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 09:54:30', '2021-05-27 09:54:30', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397853890283089922, 1397853890262118402, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:55:13', '2021-05-27 09:55:13', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397854133632413697, 1397854133603053569, '温度', '[\"热饮\",\"常温\",\"去冰\",\"少冰\",\"多冰\"]', '2021-05-27 09:56:11', '2021-05-27 09:56:11', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397854652623007745, 1397854652581064706, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 09:58:15', '2021-05-27 09:58:15', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397854652635590658, 1397854652581064706, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:58:15', '2021-05-27 09:58:15', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397854865735593986, 1397854865672679425, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 09:59:06', '2021-05-27 09:59:06', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397855742303186946, 1397855742273826817, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 10:02:35', '2021-05-27 10:02:35', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397855906497605633, 1397855906468245506, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 10:03:14', '2021-05-27 10:03:14', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397856190573621250, 1397856190540066818, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 10:04:21', '2021-05-27 10:04:21', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397859056709316609, 1397859056684150785, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 10:15:45', '2021-05-27 10:15:45', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397859277837217794, 1397859277812051969, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 10:16:37', '2021-05-27 10:16:37', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397859487502086146, 1397859487476920321, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 10:17:27', '2021-05-27 10:17:27', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397859757061615618, 1397859757036449794, '甜味', '[\"无糖\",\"少糖\",\"半躺\",\"多糖\",\"全糖\"]', '2021-05-27 10:18:32', '2021-05-27 10:18:32', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397860242086735874, 1397860242057375745, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 10:20:27', '2021-05-27 10:20:27', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397860963918065665, 1397860963880316929, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 10:23:19', '2021-05-27 10:23:19', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397861135754506242, 1397861135733534722, '甜味', '[\"无糖\",\"少糖\",\"半躺\",\"多糖\",\"全糖\"]', '2021-05-27 10:24:00', '2021-05-27 10:24:00', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397861370035744769, 1397861370010578945, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-27 10:24:56', '2021-05-27 10:24:56', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397861683459305474, 1397861683434139649, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 10:26:11', '2021-05-27 10:26:11', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397861898467717121, 1397861898438356993, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 10:27:02', '2021-05-27 10:27:02', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397862198054268929, 1397862198033297410, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-27 10:28:14', '2021-05-27 10:28:14', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1397862477835317250, 1397862477831122945, '辣度', '[\"不辣\",\"微辣\",\"中辣\"]', '2021-05-27 10:29:20', '2021-05-27 10:29:20', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398089545865015297, 1398089545676271617, '温度', '[\"热饮\",\"常温\",\"去冰\",\"少冰\",\"多冰\"]', '2021-05-28 01:31:38', '2021-05-28 01:31:38', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398089782323097601, 1398089782285348866, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-28 01:32:34', '2021-05-28 01:32:34', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398090003262255106, 1398090003228700673, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-28 01:33:27', '2021-05-28 01:33:27', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398090264554811394, 1398090264517062657, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-28 01:34:29', '2021-05-28 01:34:29', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398090455399837698, 1398090455324340225, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-28 01:35:14', '2021-05-28 01:35:14', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398090685449023490, 1398090685419663362, '温度', '[\"热饮\",\"常温\",\"去冰\",\"少冰\",\"多冰\"]', '2021-05-28 01:36:09', '2021-05-28 01:36:09', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398090825358422017, 1398090825329061889, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-28 01:36:43', '2021-05-28 01:36:43', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398091007051476993, 1398091007017922561, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-28 01:37:26', '2021-05-28 01:37:26', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398091296164851713, 1398091296131297281, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-28 01:38:35', '2021-05-28 01:38:35', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398091546531246081, 1398091546480914433, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2021-05-28 01:39:35', '2021-05-28 01:39:35', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398091729809747969, 1398091729788776450, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-28 01:40:18', '2021-05-28 01:40:18', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398091889499484161, 1398091889449152513, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-28 01:40:56', '2021-05-28 01:40:56', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398092095179763713, 1398092095142014978, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-28 01:41:45', '2021-05-28 01:41:45', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398092283877306370, 1398092283847946241, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-28 01:42:30', '2021-05-28 01:42:30', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398094018939236354, 1398094018893099009, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-28 01:49:24', '2021-05-28 01:49:24', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1398094391494094850, 1398094391456346113, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-05-28 01:50:53', '2021-05-28 01:50:53', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1399574026165727233, 1399305325713600514, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2021-06-01 03:50:25', '2021-06-01 03:50:25', 1399309715396669441, 1399309715396669441, 0);
INSERT INTO `dish_flavor` VALUES (1413389540592263169, 1413384757047271425, '温度', '[\"常温\",\"冷藏\"]', '2021-07-12 09:09:16', '2021-07-12 09:09:16', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1413389684020682754, 1413342036832100354, '温度', '[\"常温\",\"冷藏\"]', '2021-07-09 15:12:18', '2021-07-09 15:12:18', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1525538975953977347, 1525538975912034306, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2022-05-15 18:28:27', '2022-05-15 18:28:27', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1525538975953977348, 1525538975912034306, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2022-05-15 18:28:27', '2022-05-15 18:28:27', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1525802227900366850, 1525802227900366849, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2022-05-15 19:36:14', '2022-05-15 19:36:14', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1526147348982489090, 1526147348915380226, '辣度', '[\"不辣\",\"微辣\",\"中辣\",\"重辣\"]', '2022-05-16 18:27:37', '2022-05-16 18:27:37', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1526147348982489091, 1526147348915380226, '忌口', '[\"不要葱\",\"不要蒜\",\"不要香菜\",\"不要辣\"]', '2022-05-16 18:27:37', '2022-05-16 18:27:37', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1526147348982489092, 1526147348915380226, '温度', '[\"热饮\",\"常温\",\"去冰\",\"少冰\",\"多冰\"]', '2022-05-16 18:27:37', '2022-05-16 18:27:37', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1526150281048449026, 1526150033962000386, '甜味', '[\"无糖\",\"少糖\",\"半糖\",\"多糖\",\"全糖\"]', '2022-05-16 18:39:16', '2022-05-16 18:39:16', 1, 1, 0);
INSERT INTO `dish_flavor` VALUES (1526150281052643330, 1526150033962000386, '温度', '[\"热饮\",\"常温\",\"去冰\",\"少冰\",\"多冰\"]', '2022-05-16 18:39:16', '2022-05-16 18:39:16', 1, 1, 0);

-- ----------------------------
-- Table structure for employee
-- ----------------------------
DROP TABLE IF EXISTS `employee`;
CREATE TABLE `employee`  (
  `id` bigint(0) NOT NULL COMMENT '主键',
  `name` varchar(32) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '姓名',
  `username` varchar(32) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '用户名',
  `password` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '密码',
  `phone` varchar(11) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '手机号',
  `sex` varchar(2) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '性别',
  `id_number` varchar(18) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '身份证号',
  `status` int(0) NOT NULL DEFAULT 1 COMMENT '状态 0:禁用，1:正常',
  `create_time` datetime(0) NOT NULL COMMENT '创建时间',
  `update_time` datetime(0) NOT NULL COMMENT '更新时间',
  `create_user` bigint(0) NOT NULL COMMENT '创建人',
  `update_user` bigint(0) NOT NULL COMMENT '修改人',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `idx_username`(`username`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_bin COMMENT = '员工信息' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of employee
-- ----------------------------
INSERT INTO `employee` VALUES (1, '管理员', 'admin', 'e10adc3949ba59abbe56e057f20f883e', '13812312312', '1', '110101199001010047', 1, '2021-05-06 17:20:07', '2021-05-10 02:24:09', 1, 1);
INSERT INTO `employee` VALUES (1524403837031436290, '许龙杰', 'xloj', 'e10adc3949ba59abbe56e057f20f883e', '17350066930', '1', '350582200203031014', 1, '2022-05-11 22:59:31', '2022-05-29 14:12:14', 1, 1);
INSERT INTO `employee` VALUES (1524411597974446082, '王英金', 'wyj', 'e10adc3949ba59abbe56e057f20f883e', '17350066931', '1', '350582200203034016', 1, '2022-05-12 19:57:21', '2022-05-12 23:22:38', 1, 1);
INSERT INTO `employee` VALUES (1524746519582941186, '王雄戊', 'wangxiongwu', 'e10adc3949ba59abbe56e057f20f883e', '17350066932', '1', '350582200203034017', 1, '2022-05-12 21:41:13', '2022-05-12 23:47:51', 1, 1);
INSERT INTO `employee` VALUES (1524778872602648577, '许鸿皓', 'xhh', 'e10adc3949ba59abbe56e057f20f883e', '17350066933', '1', '350582200203034018', 1, '2022-05-12 23:49:47', '2022-05-13 17:17:53', 1, 1);
INSERT INTO `employee` VALUES (1525042962524868609, '炎龙铠甲', 'ylkj', 'e10adc3949ba59abbe56e057f20f883e', '17350066934', '1', '350582200203034018', 1, '2022-05-13 17:19:11', '2022-05-13 17:19:11', 1524778872602648577, 1524778872602648577);

-- ----------------------------
-- Table structure for order_detail
-- ----------------------------
DROP TABLE IF EXISTS `order_detail`;
CREATE TABLE `order_detail`  (
  `id` bigint(0) NOT NULL COMMENT '主键',
  `name` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '名字',
  `image` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '图片',
  `order_id` bigint(0) NOT NULL COMMENT '订单id',
  `dish_id` bigint(0) NULL DEFAULT NULL COMMENT '菜品id',
  `setmeal_id` bigint(0) NULL DEFAULT NULL COMMENT '套餐id',
  `dish_flavor` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '口味',
  `number` int(0) NOT NULL DEFAULT 1 COMMENT '数量',
  `amount` decimal(10, 2) NOT NULL COMMENT '金额',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_bin COMMENT = '订单明细表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of order_detail
-- ----------------------------
INSERT INTO `order_detail` VALUES (1527993282250948610, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1527993282095759361, 1397851668262465537, NULL, '热饮', 2, 168.00);
INSERT INTO `order_detail` VALUES (1527994508111790083, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1527994508111790082, 1397851668262465537, NULL, '热饮', 4, 168.00);
INSERT INTO `order_detail` VALUES (1527994508111790084, '邵阳猪血丸子', '2a50628e-7758-4c51-9fbb-d37c61cdacad.jpg', 1527994508111790082, 1397851370462687234, NULL, '去冰,不要辣,微辣', 2, 138.00);
INSERT INTO `order_detail` VALUES (1527994508111790085, '商务套餐A', '9ca84c768c464d05833f72ab828092ce.jpg', 1527994508111790082, NULL, 1526092683259478017, NULL, 5, 1234.00);
INSERT INTO `order_detail` VALUES (1527994508111790086, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1527994508111790082, 1397851668262465537, NULL, '常温', 2, 168.00);
INSERT INTO `order_detail` VALUES (1527994508111790087, '邵阳猪血丸子', '2a50628e-7758-4c51-9fbb-d37c61cdacad.jpg', 1527994508111790082, 1397851370462687234, NULL, '去冰,不要蒜,微辣', 1, 138.00);
INSERT INTO `order_detail` VALUES (1528002707531558914, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1528002707531558913, 1397851668262465537, NULL, '多冰', 1, 168.00);
INSERT INTO `order_detail` VALUES (1528002707531558915, '儿童套餐A', '7a364d8159164ef38749df3ba997a587.jpg', 1528002707531558913, NULL, 1526092454355337217, NULL, 1, 124.00);
INSERT INTO `order_detail` VALUES (1528002707594473473, '王老吉', 'd30af3240ba744f38aeb9e9fca9c8bf2.png', 1528002707531558913, 1526150033962000386, NULL, '半糖,去冰', 1, 5.00);
INSERT INTO `order_detail` VALUES (1530426476183162882, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530426476183162881, 1397851668262465537, NULL, '去冰', 1, 168.00);
INSERT INTO `order_detail` VALUES (1530438453253218306, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530438453190303745, 1397851668262465537, NULL, '热饮', 4, 168.00);
INSERT INTO `order_detail` VALUES (1530438453253218307, '邵阳猪血丸子', '2a50628e-7758-4c51-9fbb-d37c61cdacad.jpg', 1530438453190303745, 1397851370462687234, NULL, '去冰,不要辣,微辣', 2, 138.00);
INSERT INTO `order_detail` VALUES (1530438453253218308, '商务套餐A', '9ca84c768c464d05833f72ab828092ce.jpg', 1530438453190303745, NULL, 1526092683259478017, NULL, 5, 1234.00);
INSERT INTO `order_detail` VALUES (1530438453253218309, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530438453190303745, 1397851668262465537, NULL, '常温', 2, 168.00);
INSERT INTO `order_detail` VALUES (1530438453253218310, '邵阳猪血丸子', '2a50628e-7758-4c51-9fbb-d37c61cdacad.jpg', 1530438453190303745, 1397851370462687234, NULL, '去冰,不要蒜,微辣', 1, 138.00);
INSERT INTO `order_detail` VALUES (1530578898349035522, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530578898349035521, 1397851668262465537, NULL, '热饮', 2, 168.00);
INSERT INTO `order_detail` VALUES (1530578898349035523, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530578898349035521, 1397851668262465537, NULL, '少冰', 2, 168.00);
INSERT INTO `order_detail` VALUES (1530578898349035524, '商务套餐A', '9ca84c768c464d05833f72ab828092ce.jpg', 1530578898349035521, NULL, 1526092683259478017, NULL, 1, 1234.00);
INSERT INTO `order_detail` VALUES (1530578898349035525, '霸王别姬', '057dd338-e487-4bbc-a74c-0384c44a9ca3.jpg', 1530578898349035521, 1397850851245600769, NULL, '不要辣,重辣', 2, 128.00);
INSERT INTO `order_detail` VALUES (1530579391045537794, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530579391045537793, 1397851668262465537, NULL, '少冰', 1, 168.00);
INSERT INTO `order_detail` VALUES (1530579391045537795, '邵阳猪血丸子', '2a50628e-7758-4c51-9fbb-d37c61cdacad.jpg', 1530579391045537793, 1397851370462687234, NULL, '少冰,不要香菜,重辣', 1, 138.00);
INSERT INTO `order_detail` VALUES (1530579690267185153, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530579690204270593, 1397851668262465537, NULL, '去冰', 1, 168.00);
INSERT INTO `order_detail` VALUES (1530579690267185154, '商务套餐A', '9ca84c768c464d05833f72ab828092ce.jpg', 1530579690204270593, NULL, 1526092683259478017, NULL, 2, 1234.00);
INSERT INTO `order_detail` VALUES (1530579690267185155, '邵阳猪血丸子', '2a50628e-7758-4c51-9fbb-d37c61cdacad.jpg', 1530579690204270593, 1397851370462687234, NULL, '去冰,不要香菜,微辣', 1, 138.00);
INSERT INTO `order_detail` VALUES (1530579690267185156, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530579690204270593, 1397851668262465537, NULL, '少冰', 2, 168.00);
INSERT INTO `order_detail` VALUES (1530591848899280898, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530591848899280897, 1397851668262465537, NULL, '去冰', 1, 168.00);
INSERT INTO `order_detail` VALUES (1530591848899280899, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530591848899280897, 1397851668262465537, NULL, '常温', 1, 168.00);
INSERT INTO `order_detail` VALUES (1530591848899280900, '邵阳猪血丸子', '2a50628e-7758-4c51-9fbb-d37c61cdacad.jpg', 1530591848899280897, 1397851370462687234, NULL, '少冰,不要香菜,重辣', 1, 138.00);
INSERT INTO `order_detail` VALUES (1531108493979910145, '邵阳猪血丸子', '2a50628e-7758-4c51-9fbb-d37c61cdacad.jpg', 1531108493916995585, 1397851370462687234, NULL, '常温,不要蒜,中辣', 1, 138.00);

-- ----------------------------
-- Table structure for orders
-- ----------------------------
DROP TABLE IF EXISTS `orders`;
CREATE TABLE `orders`  (
  `id` bigint(0) NOT NULL COMMENT '主键',
  `number` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '订单号',
  `status` int(0) NOT NULL DEFAULT 1 COMMENT '订单状态 1待付款，2待派送，3已派送，4已完成，5已取消',
  `user_id` bigint(0) NOT NULL COMMENT '下单用户',
  `address_book_id` bigint(0) NOT NULL COMMENT '地址id',
  `order_time` datetime(0) NOT NULL COMMENT '下单时间',
  `checkout_time` datetime(0) NOT NULL COMMENT '结账时间',
  `pay_method` int(0) NOT NULL DEFAULT 1 COMMENT '支付方式 1微信,2支付宝',
  `amount` decimal(10, 2) NOT NULL COMMENT '实收金额',
  `remark` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '备注',
  `phone` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL,
  `address` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL,
  `user_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL,
  `consignee` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_bin COMMENT = '订单表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of orders
-- ----------------------------
INSERT INTO `orders` VALUES (1527993282095759361, '1527993282095759361', 4, 1527583379548139521, 1527927742178390017, '2022-05-21 20:42:42', '2022-05-21 20:42:42', 1, 336.00, '', '17350066933', '聚窟洲天人城', NULL, '胡桃');
INSERT INTO `orders` VALUES (1527994508111790082, '1527994508111790082', 4, 1526570471523463170, 1526795358695444481, '2022-05-21 20:47:34', '2022-05-21 20:47:34', 1, 7592.00, '', '17350066931', '聚窟洲三族大议所', NULL, '季沧海');
INSERT INTO `orders` VALUES (1528002707531558913, '1528002707531558913', 4, 1526570471523463170, 1526795358695444481, '2022-05-21 21:20:09', '2022-05-21 21:20:09', 1, 297.00, '多加肉~~~', '17350066931', '聚窟洲三族大议所', NULL, '季沧海');
INSERT INTO `orders` VALUES (1530426476183162881, '1530426476183162881', 4, 1526570471523463170, 1526795358695444481, '2022-05-28 13:51:21', '2022-05-28 13:51:21', 1, 168.00, '', '17350066931', '聚窟洲三族大议所', NULL, '季沧海');
INSERT INTO `orders` VALUES (1530438453190303745, '1530438453190303745', 4, 1526570471523463170, 1526795358695444481, '2022-05-28 14:38:56', '2022-05-28 14:38:56', 1, 7592.00, '', '17350066931', '聚窟洲三族大议所', NULL, '季沧海');
INSERT INTO `orders` VALUES (1530578898349035521, '1530578898349035521', 3, 1530511956485451777, 1530537771646439425, '2022-05-28 23:57:01', '2022-05-28 23:57:01', 1, 2162.00, '', '17350066935', '人防侧耳TV费', NULL, '王雄戊');
INSERT INTO `orders` VALUES (1530579391045537793, '1530579391045537793', 2, 1530579216340193281, 1530579374247350273, '2022-05-28 23:58:58', '2022-05-28 23:58:58', 1, 306.00, '', '15659698017', '莆田学院', NULL, '王雄戊');
INSERT INTO `orders` VALUES (1530579690204270593, '1530579690204270593', 2, 1526570471523463170, 1526795358695444481, '2022-05-29 00:00:10', '2022-05-29 00:00:10', 1, 3110.00, '', '17350066931', '聚窟洲三族大议所', NULL, '季沧海');
INSERT INTO `orders` VALUES (1530591848899280897, '1530591848899280897', 2, 1530511956485451777, 1530537771646439425, '2022-05-29 00:48:28', '2022-05-29 00:48:28', 1, 474.00, '', '17350066935', '人防侧耳TV费', NULL, '王雄戊');
INSERT INTO `orders` VALUES (1531108493916995585, '1531108493916995585', 3, 1531106576365092865, 1531108389982142466, '2022-05-30 11:01:26', '2022-05-30 11:01:26', 1, 138.00, '123', '17350066930', 'ptu', '王雄戊', '王雄戊');

-- ----------------------------
-- Table structure for setmeal
-- ----------------------------
DROP TABLE IF EXISTS `setmeal`;
CREATE TABLE `setmeal`  (
  `id` bigint(0) NOT NULL COMMENT '主键',
  `category_id` bigint(0) NOT NULL COMMENT '菜品分类id',
  `name` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '套餐名称',
  `price` decimal(10, 2) NOT NULL COMMENT '套餐价格',
  `status` int(0) NULL DEFAULT NULL COMMENT '状态 0:停用 1:启用',
  `code` varchar(32) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '编码',
  `description` varchar(512) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '描述信息',
  `image` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '图片',
  `create_time` datetime(0) NOT NULL COMMENT '创建时间',
  `update_time` datetime(0) NOT NULL COMMENT '更新时间',
  `create_user` bigint(0) NOT NULL COMMENT '创建人',
  `update_user` bigint(0) NOT NULL COMMENT '修改人',
  `is_deleted` int(0) NOT NULL DEFAULT 0 COMMENT '是否删除',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `idx_setmeal_name`(`name`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_bin COMMENT = '套餐' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of setmeal
-- ----------------------------
INSERT INTO `setmeal` VALUES (1526092454355337217, 1413386191767674881, '儿童套餐A', 12400.00, 1, '', '儿童专属套餐。。。', '7a364d8159164ef38749df3ba997a587.jpg', '2022-05-16 14:49:29', '2022-05-16 18:03:34', 1, 1, 0);
INSERT INTO `setmeal` VALUES (1526092683259478017, 1413342269393674242, '商务套餐A', 123400.00, 1, '', '这个不好吃！', '9ca84c768c464d05833f72ab828092ce.jpg', '2022-05-16 14:50:24', '2022-05-16 16:30:28', 1, 1, 0);
INSERT INTO `setmeal` VALUES (1526121199803899905, 1413386191767674881, '儿童套餐B', 12400.00, 1, '', '无', '069b984237f84acfb224bda90644fcea.jpg', '2022-05-16 16:43:43', '2022-05-16 17:59:43', 1, 1, 0);
INSERT INTO `setmeal` VALUES (1531114915232784386, 1413342269393674242, '商务套餐B', 99900.00, 1, '', '无', '8ce6e68ef8a9496996f454db2e5309c3.jpg', '2022-05-30 11:26:57', '2022-05-30 11:26:57', 1, 1, 0);

-- ----------------------------
-- Table structure for setmeal_dish
-- ----------------------------
DROP TABLE IF EXISTS `setmeal_dish`;
CREATE TABLE `setmeal_dish`  (
  `id` bigint(0) NOT NULL COMMENT '主键',
  `setmeal_id` varchar(32) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '套餐id ',
  `dish_id` varchar(32) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '菜品id',
  `name` varchar(32) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '菜品名称 （冗余字段）',
  `price` decimal(10, 2) NULL DEFAULT NULL COMMENT '菜品原价（冗余字段）',
  `copies` int(0) NOT NULL COMMENT '份数',
  `sort` int(0) NOT NULL DEFAULT 0 COMMENT '排序',
  `create_time` datetime(0) NOT NULL COMMENT '创建时间',
  `update_time` datetime(0) NOT NULL COMMENT '更新时间',
  `create_user` bigint(0) NOT NULL COMMENT '创建人',
  `update_user` bigint(0) NOT NULL COMMENT '修改人',
  `is_deleted` int(0) NOT NULL DEFAULT 0 COMMENT '是否删除',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_bin COMMENT = '套餐菜品关系' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of setmeal_dish
-- ----------------------------
INSERT INTO `setmeal_dish` VALUES (1526092683259478018, '1526092683259478017', '1397851370462687234', '邵阳猪血丸子', 13800.00, 1, 0, '2022-05-16 14:50:24', '2022-05-16 14:50:24', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1526092683326586881, '1526092683259478017', '1397851099502260226', '全家福', 11800.00, 1, 0, '2022-05-16 14:50:24', '2022-05-16 14:50:24', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1526092683326586882, '1526092683259478017', '1397853709101740034', '蒜泥白肉', 9800.00, 1, 0, '2022-05-16 14:50:24', '2022-05-16 14:50:24', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1526092683326586883, '1526092683259478017', '1397853890262118402', '鱼香肉丝', 3800.00, 1, 0, '2022-05-16 14:50:24', '2022-05-16 14:50:24', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1526092683326586884, '1526092683259478017', '1413342036832100354', '北冰洋', 500.00, 1, 0, '2022-05-16 14:50:24', '2022-05-16 14:50:24', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1526140329168822273, '1526121199803899905', '1397851370462687234', '邵阳猪血丸子', 13800.00, 1, 0, '2022-05-16 17:59:43', '2022-05-16 17:59:43', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1526140329168822274, '1526121199803899905', '1397861683434139649', '清蒸河鲜海鲜', 38800.00, 1, 0, '2022-05-16 17:59:43', '2022-05-16 17:59:43', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1526140329168822275, '1526121199803899905', '1413385247889891330', '米饭', 200.00, 1, 0, '2022-05-16 17:59:43', '2022-05-16 17:59:43', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1526141297658781698, '1526092454355337217', '1397851668262465537', '口味蛇', 16800.00, 1, 0, '2022-05-16 18:03:34', '2022-05-16 18:03:34', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1526141297658781699, '1526092454355337217', '1397854652581064706', '麻辣水煮鱼', 14800.00, 1, 0, '2022-05-16 18:03:34', '2022-05-16 18:03:34', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1526141297658781700, '1526092454355337217', '1413385247889891330', '米饭', 200.00, 1, 0, '2022-05-16 18:03:34', '2022-05-16 18:03:34', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1531114915232784387, '1531114915232784386', '1413385247889891330', '米饭', 200.00, 1, 0, '2022-05-30 11:26:57', '2022-05-30 11:26:57', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1531114915232784388, '1531114915232784386', '1397862198033297410', '老火靓汤', 49800.00, 1, 0, '2022-05-30 11:26:57', '2022-05-30 11:26:57', 1, 1, 0);
INSERT INTO `setmeal_dish` VALUES (1531114915232784389, '1531114915232784386', '1397853890262118402', '鱼香肉丝', 3800.00, 1, 0, '2022-05-30 11:26:57', '2022-05-30 11:26:57', 1, 1, 0);

-- ----------------------------
-- Table structure for shopping_cart
-- ----------------------------
DROP TABLE IF EXISTS `shopping_cart`;
CREATE TABLE `shopping_cart`  (
  `id` bigint(0) NOT NULL COMMENT '主键',
  `name` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '名称',
  `image` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '图片',
  `user_id` bigint(0) NOT NULL COMMENT '主键',
  `dish_id` bigint(0) NULL DEFAULT NULL COMMENT '菜品id',
  `setmeal_id` bigint(0) NULL DEFAULT NULL COMMENT '套餐id',
  `dish_flavor` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '口味',
  `number` int(0) NOT NULL DEFAULT 1 COMMENT '数量',
  `amount` decimal(10, 2) NOT NULL COMMENT '金额',
  `create_time` datetime(0) NOT NULL COMMENT '创建时间',
  `update_time` datetime(0) NULL DEFAULT NULL,
  `create_user` bigint(0) NOT NULL,
  `update_user` bigint(0) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_bin COMMENT = '购物车' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of shopping_cart
-- ----------------------------
INSERT INTO `shopping_cart` VALUES (1530542795181109249, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1527583379548139521, 1397851668262465537, NULL, '常温', 1, 168.00, '2022-05-28 21:33:33', '2022-05-28 21:33:53', 1527583379548139521, 1527583379548139521);
INSERT INTO `shopping_cart` VALUES (1530547299532169217, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530547285930041345, 1397851668262465537, NULL, '去冰', 1, 168.00, '2022-05-28 21:51:27', '2022-05-28 21:51:27', 1530547285930041345, 1530547285930041345);
INSERT INTO `shopping_cart` VALUES (1530547362010521602, '邵阳猪血丸子', '2a50628e-7758-4c51-9fbb-d37c61cdacad.jpg', 1530547285930041345, 1397851370462687234, NULL, '少冰,不要香菜,重辣', 1, 138.00, '2022-05-28 21:51:42', '2022-05-28 21:51:42', 1530547285930041345, 1530547285930041345);
INSERT INTO `shopping_cart` VALUES (1530547785714946050, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530547775707336706, 1397851668262465537, NULL, '少冰', 1, 168.00, '2022-05-28 21:53:23', '2022-05-28 21:53:23', 1530547775707336706, 1530547775707336706);
INSERT INTO `shopping_cart` VALUES (1530907493474099202, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530893480702885890, 1397851668262465537, NULL, '去冰', 4, 168.00, '2022-05-29 21:42:44', '2022-05-29 21:43:37', 1530893480702885890, 1530893480702885890);
INSERT INTO `shopping_cart` VALUES (1530907516895092737, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530893480702885890, 1397851668262465537, NULL, '多冰', 4, 168.00, '2022-05-29 21:42:50', '2022-05-29 21:43:35', 1530893480702885890, 1530893480702885890);
INSERT INTO `shopping_cart` VALUES (1530907587069992962, '邵阳猪血丸子', '2a50628e-7758-4c51-9fbb-d37c61cdacad.jpg', 1530893480702885890, 1397851370462687234, NULL, '去冰,不要辣,中辣', 2, 138.00, '2022-05-29 21:43:06', '2022-05-29 21:43:45', 1530893480702885890, 1530893480702885890);
INSERT INTO `shopping_cart` VALUES (1530907764749099010, '邵阳猪血丸子', '2a50628e-7758-4c51-9fbb-d37c61cdacad.jpg', 1530893480702885890, 1397851370462687234, NULL, '常温,不要香菜,中辣', 1, 138.00, '2022-05-29 21:43:49', '2022-05-29 21:43:49', 1530893480702885890, 1530893480702885890);
INSERT INTO `shopping_cart` VALUES (1530909057932713985, '口味蛇', '0f4bd884-dc9c-4cf9-b59e-7d5958fec3dd.jpg', 1530893480702885890, 1397851668262465537, NULL, '少冰', 1, 168.00, '2022-05-29 21:48:57', '2022-05-29 21:48:57', 1530893480702885890, 1530893480702885890);

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user`  (
  `id` bigint(0) NOT NULL COMMENT '主键',
  `name` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '姓名',
  `phone` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '手机号',
  `password` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '密码',
  `id_number` varchar(18) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '身份证号',
  `avatar` varchar(500) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '头像',
  `status` int(0) NULL DEFAULT 1 COMMENT '状态 0:禁用，1:正常',
  `username` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NULL DEFAULT NULL COMMENT '用户名',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `idx_username`(`username`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_bin COMMENT = '用户信息' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES (1530547775707336706, NULL, '15659698077', NULL, NULL, NULL, 1, 'w');
INSERT INTO `user` VALUES (1530864476050460673, NULL, '15659698236', NULL, NULL, NULL, 1, 'e');
INSERT INTO `user` VALUES (1531106576365092865, '王雄戊', '17350066930', 'e10adc3949ba59abbe56e057f20f883e', '350582200203044015', NULL, 1, 'wxw1');
INSERT INTO `user` VALUES (1531660926380408833, '许鸿皓', '13656048150', 'e10adc3949ba59abbe56e057f20f883e', '350681200210230563', NULL, 1, 'xhh');
INSERT INTO `user` VALUES (1531661497669902337, '王英金', '15880527956', 'e10adc3949ba59abbe56e057f20f883e', '350681200210230513', NULL, 1, '王英金');
INSERT INTO `user` VALUES (1531662517577719809, '王英金', '13859245388', 'e10adc3949ba59abbe56e057f20f883e', '350681200210230546', NULL, 1, 'wyj');

SET FOREIGN_KEY_CHECKS = 1;
